{"weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"dtype": "float32", "shape": [512, 128], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [128], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [500, 500], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [500], "name": "dense_3/bias"}, {"dtype": "float32", "shape": [500, 3857], "name": "dense_4/kernel"}, {"dtype": "float32", "shape": [3857], "name": "dense_4/bias"}, {"dtype": "float32", "shape": [3857, 100], "name": "embedding_1/embeddings"}, {"dtype": "float32", "shape": [100, 1024], "name": "lstm_1/kernel"}, {"dtype": "float32", "shape": [256, 1024], "name": "lstm_1/recurrent_kernel"}, {"dtype": "float32", "shape": [1024], "name": "lstm_1/bias"}, {"dtype": "float32", "shape": [256, 2000], "name": "lstm_2/kernel"}, {"dtype": "float32", "shape": [500, 2000], "name": "lstm_2/recurrent_kernel"}, {"dtype": "float32", "shape": [2000], "name": "lstm_2/bias"}, {"dtype": "float32", "shape": [256, 128], "name": "time_distributed_1/kernel"}, {"dtype": "float32", "shape": [128], "name": "time_distributed_1/bias"}]}], "modelTopology": {"training_config": {"metrics": ["accuracy"], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "lr": 0.0010000000474974513}}, "loss_weights": null, "sample_weight_mode": null}, "keras_version": "2.2.4", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 7, 7, 512], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 30], "name": "input_2", "sparse": false}, "name": "input_2"}, {"class_name": "GlobalMaxPooling2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": true, "name": "global_max_pooling2d_1", "data_format": "channels_last"}, "name": "global_max_pooling2d_1"}, {"class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_1", "dtype": "float32", "output_dim": 100, "trainable": true, "embeddings_regularizer": null, "input_dim": 3857, "mask_zero": true, "embeddings_constraint": null, "batch_input_shape": [null, 30], "activity_regularizer": null, "input_length": 30}, "name": "embedding_1"}, {"class_name": "Dense", "inbound_nodes": [[["global_max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "name": "dense_1"}, {"class_name": "LSTM", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "stateful": false, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "name": "lstm_1"}, {"class_name": "RepeatVector", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"trainable": true, "name": "repeat_vector_1", "n": 30}, "name": "repeat_vector_1"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_1"}, "name": "time_distributed_1"}, {"class_name": "Concatenate", "inbound_nodes": [[["repeat_vector_1", 0, 0, {}], ["time_distributed_1", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "name": "concatenate_1"}, {"class_name": "LSTM", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 500, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "stateful": false, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_2", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}, "name": "lstm_2"}, {"class_name": "Dense", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 500, "use_bias": true, "activity_regularizer": null}, "name": "dense_3"}, {"class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_4", "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3857, "use_bias": true, "activity_regularizer": null}, "name": "dense_4"}], "output_layers": [["dense_4", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.1.2", "format": "layers-model"}